{
  "navbar": {
    "navbarBrand": { "text": "Noodles", "url": "/" },
    "navbarItemOnion": { "text": "onion recipes", "url": "/category/onion" },
    "navbarItemChicken": {
      "text": "chicken recipes",
      "url": "/category/chicken"
    }
  },
  "mainPage": {
    "noodleAppHeader": "Noodle Recipes",
    "recipeListHeader": "Recipe List",
    "recipeListItems": [
      { "text": "IPOH SHREDDED CHICKEN HOR FUN", "url": "/recipe/0" },
      { "text": "CHICKEN BOLOGNESE", "url": "/recipe/1" },
      {
        "text": "SHANGHAI SPRING ONION OIL NOODLES (葱油拌面)",
        "url": "/recipe/2"
      },
      {
        "text": "RAMEN NOODLES WITH SPRING ONIONS AND GARLIC CRISP",
        "url": "/recipe/3"
      }
    ],
    "categoryListHeader": "Category List",
    "categoryListItems": [
      { "text": "Chicken", "url": "/category/chicken" },
      { "text": "Onion", "url": "/category/onion" }
    ]
  },
  "recipes": [
    {
      "source": "BBC Good Food",
      "label": "IPOH SHREDDED CHICKEN HOR FUN",
      "url": "http://www.edamam.com/recipe/udon-noodle-soup-bf283c727cd11fb8ce42b98f09dabbac/noodle",
      "ingredients": [
        "thin hor fun noodles",
        "dry shiitake mushrooms",
        "vegetables like gai lan (Chinese broccoli)",
        "chicken breast"
      ],
      "instructions": [
        "Soak the mushroom in 2 cups of hot water for at least 30 minutes (1 hour if you have the time) while preparing other things and then slice (or you may leave them whole). Save the soaking liquid",
        "Bring a large pot of water to a boil and blanch the vegetables for 1 minute and then refresh with cold water",
        "Place the chicken breast with 1 cup of chicken stock in the inner pot of Instant Pot. Close the lid and turn the steam release valve to seal. Press pressure cooker and make sure it's on high pressure. Set the time to 10 minutes and release the pressure immediately after. Wait for 5 minutes before slicing or shredding the meat",
        "Bring chicken stock to a boil and then put the chicken breast in and simmer for 15 minutes. Turn off the heat and let the residual heat to continue cooking the chicken. Remove and rest for 5 minutes before slicing or shredding the meat",
        "Strain the liquid from cooking the chicken into a large pot. Add the liquid from soaking the mushrooms. Add 1 litre of chicken stock. Bring to a boil and then add the mushrooms and seasonings and lower the heat to let the mushrooms cook for about 15 minutes. I suggest thickening the soup only when you ready to serve the kai si hor fun",
        "Bring a large pot of water to a boil. If you are using fresh hor fun, cook the noodles briefly, usually less than 1 minute. It is basically just to heat up the noodles. If you are using dry hor fun like me, cook until the noodles are al dente. Do not rinse the noodles with water. I suggest cooking the noodles only when you are closer to serving the kai si hor fun",
        "When ready to serve, portion the hor fun into individual bowl or platter accompanied by few stalks of veggie, shredded chicken meat. Bring the soup back to a boil. Give the cornstarch solution a stir and pour into the soup while the other hand is stirring. Keep stirring until the soup is thickened. Generously ladle this thickened soup over the noodles along with some slices of mushrooms. Serve immediately"
      ],
      "yield": 4,
      "caution": "Sulfites",
      "image": "/images/IPOH-SHREDDED-CHICKEN-HOR-FUN.JPG",
      "category": "chicken"
    },
    {
      "source": "Smitten Kitchen",
      "label": "CHICKEN BOLOGNESE",
      "url": "http://www.edamam.com/recipe/noodle-kugel-recipes-d6452a86e2edb13bbeb305904fd2a7f1/noodle",
      "ingredients": [
        "1 tablespoon olive oil",
        "1 onion diced",
        "100 g lardons/diced bacon (preferably smoked)",
        "2 cloves garlic crushed or grated",
        "500 g chicken thigh",
        "400 g tin chopped tomatoes",
        "200 ml chicken stock (or 1 chicken stock cube dissolved in 200 ml water)",
        "Salt and pepper to taste"
      ],
      "instructions": [
        "Place the oil and diced onions in a medium to large saucepan and cook over a low heat, with the lid on for 3 minutes, to soften the onions. Stir occasionally",
        "Turn the heat up and add the lardons/diced bacon. Fry for 2 minutes, stirring regularly, until the lardons and onions are lightly browned.",
        "Turn the heat back down and add the garlic. Fry for 1 minute, stirring occasionally.",
        "Add the chicken, tomatoes, stock and herbs, plus salt and pepper to taste. Bring to the boil, then turn down low and simmer for 20 minutes, without a lid, until the chicken is tender, and the sauce reduced.",
        "Remove the chicken onto a place and quickly shred with two forks.Return the chicken to the sauce and simmer for another couple of minutes.",
        "Serve with your choice of pasta shape and sprinkled with parmesan (or cheddar if you prefer)."
      ],
      "yield": 4,
      "caution": "Sulfites",
      "image": "/images/chicken-bolognese.JPG",
      "category": "chicken"
    },
    {
      "source": "101 Cookbooks",
      "label": "SHANGHAI SPRING ONION OIL NOODLES (葱油拌面)",
      "url": "http://www.edamam.com/recipe/pomelo-noodle-salad-e12bae27e714d81595c393266df43a98/noodle",
      "ingredients": [
        "4 tbsp cooking oil",
        "5 stalk spring onion, cut into long sections",
        "2 tbsp light soy sauce",
        "2 tbsp dark soy sauce",
        "2 tsp sugar",
        "400 g dried thin, round noodles"
      ],
      "instructions": [
        "Pour oil in a wok. Add spring onion. Leave to simmer over a medium low heat until it starts to brown. Take the onion out and set aside (see note).",
        "Add soy sauce and sugar to the oil. Cook until the sauce starts to bubble. Turn off the heat.",
        "Meanwhile, bring a large pot of water to a boil. Cook noodles following the instructions on the package. Drain then briefly rinse under running water.",
        "Place noodles in the wok. Stir well to evenly coat the noodles with the sauce.",
        "Portion out the noodles into 4 serving bowls. Top with fried spring onion."
      ],
      "yield": 5,
      "caution": "Gluten",
      "image": "/images/SHANGHAI-SPRING-ONION-OIL-NOODLES.JPG",
      "category": "onion"
    },
    {
      "source": "Simply Recipes",
      "label": "RAMEN NOODLES WITH SPRING ONIONS AND GARLIC CRISP",
      "url": "http://www.edamam.com/recipe/chicken-noodle-soup-recipes-c1348377891b4c1a81648e55b12ebd00/noodle",
      "ingredients": [
        "1 bunch spring onions or scallions, very thinly sliced, divided",
        "1 3\" piece ginger, peeled, thinly sliced",
        "4 garlic cloves, thinly sliced",
        "½ cup vegetable or sunflower oil",
        "½ serrano or other green chile, thinly sliced (with seeds)",
        "¼ cup finely chopped tender herbs (such as cilantro, mint, and/or basil)",
        "2 Tbsp. low-sodium soy sauce",
        "1 tsp. freshly ground black pepper",
        "½ tsp. kosher salt and sugar",
        "1 Tbsp. unseasoned rice vinegar",
        "2 5-oz. packages fresh wavy ramen noodles",
        "1 Tbsp. unsalted butter, cut into pieces"
      ],
      "instructions": [
        "Place half of spring onions in a large heatproof bowl and set a fine-mesh sieve on top; set aside. Combine remaining spring onions with ginger, garlic, and oil in a small saucepan. Set over medium-high and cook, stirring occasionally, until garlic is golden and scallions are beginning to crisp and turn golden brown, 8–10 minutes.",
        "Pour mixture through reserved sieve onto spring onions. Turn out garlic crisp in sieve onto paper towels to drain. Stir spring onions in bowl until just softened, about 1 minute. Stir in chile, herbs, soy sauce, vinegar, sesame seeds, pepper, salt, and sugar. Let dressing sit 10 minutes.",
        "Meanwhile, cook noodles according to package directions. Drain and rinse under warm water to get rid of any excess starch.",
        "Transfer noodles to bowl with dressing and add butter and half of garlic crisp; toss to coat noodles. Divide among bowls; top with remaining garlic crisp."
      ],
      "yield": 12,
      "caution": "FODMAP",
      "image": "/images/Ramen-Noodles-With-Spring-Onions-and-Garlic-Crisp.JPG",
      "category": "onion"
    }
  ]
}
